[
  {
    "id": "f4a3ba84-0aee-425c-90d9-adde1e096b62",
    "source": "remotive",
    "sourceId": "2086826",
    "title": "Client Support Specialist",
    "company": "Clipboard Health",
    "location": "Europe, Canada, South Africa, Philippines, Jamaica",
    "isRemote": true,
    "category": "Customer Service",
    "salaryText": "",
    "salaryMin": null,
    "salaryMax": null,
    "descriptionPreview": "About the Role \n This is not a traditional call center role you will be the frontline specialist for our most valuable business clients, our workplace customers. Your job is to proactively solve client issues, prevent ch",
    "description": "About the Role \n This is not a traditional call center role you will be the frontline specialist for our most valuable business clients, our workplace customers. Your job is to proactively solve client issues, prevent churn, and ensure a seamless experience for our customers. Clipboard Health is looking for highly motivated, customer-focused individuals to join our team as B2B Client Support Specialists (Workplace Support Agents). \n This role is open to candidates of all experience levels what matters most is your ability to handle business customers professionally and solve problems effectively. No specific degree required. \n \n Success Factors \n \n \n Customer-Centric Mindset   You genuinely care about helping customers and take ownership of their problems. \n \n \n Strong Communication Skills   Clear, professional English (both spoken and written) is critical for success in this role. \n \n \n Proactive Problem-Solving   You don t just follow scripts you think critically and find long-term solutions for customers. \n \n \n High Accountability   We value people who hold themselves to high standards and consistently deliver results. \n \n \n \n Responsibilities \n \n \n This is primarily a voice-based role , with additional responsibilities that include handling emails as needed \n \n \n \n \n Deliver fast, accurate, and empathetic support to our workplace customers across voice and email, resolving shift, payment, and platform-related issues in real time \n \n \n Navigate tools like Zendesk and the Clipboard Health portal to investigate cases, update form fields, log clear internal notes, and maintain accurate documentation \n \n \n Apply sound judgment and critical thinking to troubleshoot issues, follow or adapt workflows, and escalate only when necessary \n \n \n Develop deep expertise in our products and processes to identify recurring issues or process gaps, helping improve both customer experiences and internal operations. \n \n \n Work cross-functionally with teams such as Billing, Account Management, and Worker Operations to gather the necessary information and ensure customer issues are resolved effectively \n \n \n Uphold our values such as unreasonably fast, ownership, and uncomfortably high standards in every interaction \n \n \n \n Why Join Clipboard Health? \n \n \n 100% Remote   Always. Work from anywhere in the world. \n \n \n Fast-Paced Startup Environment. Join a company that values curiosity, independence, and growth. \n \n \n A Hiring Process That Rewards Skills, Not Just Experience. Every applicant gets a fair shot our selection is based on real-world problem-solving ability, not just credentials. \n \n \n Opportunity to make a significant impact with our workplace customers \n \n \n \n Hiring Process \n \n \n Application \n \n \n Case Study \n \n \n Interview with Hiring Manager \n \n \n Executive Interview \n \n \n Offer",
    "applyUrl": "https://remotive.com/remote-jobs/customer-service/client-support-specialist-2086826",
    "tags": [
      "documentation",
      "zendesk",
      "account management",
      "startup",
      "Linux/Unix"
    ],
    "publishedAt": "2026-02-16T14:05:25",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-18T00:37:13.754Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "7cd0fec1-c84e-441e-908a-dce560381a25",
    "source": "remotive",
    "sourceId": "1919266",
    "title": "Senior Independent AI Engineer / Architect",
    "company": "A.Team",
    "location": "Americas, Europe, Israel",
    "isRemote": true,
    "category": "Software Development",
    "salaryText": "$120 - $170 /hour",
    "salaryMin": 120,
    "salaryMax": 170,
    "descriptionPreview": "Location: Americas, Europe, or Israel \n The Opportunity \n Join A.Team s invite-only network of senior builders and access exclusive missions with Fortune 500s and top startups. This isn t client work or employment it s a",
    "description": "Location: Americas, Europe, or Israel \n The Opportunity \n Join A.Team s invite-only network of senior builders and access exclusive missions with Fortune 500s and top startups. This isn t client work or employment it s a vetted collective where you re matched to impactful projects. At A.Team, you won t just implement someone else s plan. You ll be the technical decision-maker, owning everything from model design to enterprise integration. \n Why A.Team \n \n \n Elite peers : ex-OpenAI, Google, Meta, Amazon. \n \n \n Precision matching : Missions in LLMs, CV, NLP, ML infra, fine-tuning. \n \n \n Compensation :  120  170/hr, biweekly payouts, you keep 100%. \n \n \n Autonomy : Choose only missions that excite you no small gigs, no chasing. \n \n \n What You ll Do \n \n \n Lead the design, deployment, and scaling of production AI systems. \n \n \n Build ambitious software 0 1 in small, senior teams (3 5 people). \n \n \n Scope, propose, and execute solutions with real ownership. \n \n \n Partner with founders, CTOs, and product leaders to deliver outcomes that matter. \n \n \n Who Thrives Here \n \n \n Senior AI/ML Engineers with production systems live. \n \n \n AI Architects who ve built enterprise AI stacks. \n \n \n Tech Leaders balancing architecture with business outcomes. \n \n \n Specialists in LLMs, CV, NLP, or infra with proven depth. \n \n \n Not a fit : under 4 years  experience, simple website builders, or small gig seekers. \n Proof in the Network \n Your peers have scaled apps to millions, built enterprise AI platforms, shipped AI at unicorns, and deployed infra handling billions/day. \n How to Apply \n Apply once at build.a.team/apply-ai . Short, rigorous process we care more about what you ve built than lengthy forms.",
    "applyUrl": "https://remotive.com/remote-jobs/software-development/senior-independent-ai-engineer-architect-1919266",
    "tags": [
      "go",
      "UI/UX",
      "wordpress",
      "chat",
      "apple",
      "testing",
      "catalyst"
    ],
    "publishedAt": "2026-02-16T10:16:38",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-18T00:37:13.754Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "435e5978-4cf3-48e5-a5a3-b153ffc4a22c",
    "source": "remotive",
    "sourceId": "1919265",
    "title": "Senior Independent Software Developer",
    "company": "A.Team",
    "location": "Americas, Europe, Israel",
    "isRemote": true,
    "category": "Software Development",
    "salaryText": "$90 - $150 /hour",
    "salaryMin": 90,
    "salaryMax": 150,
    "descriptionPreview": "You must be located in the Americas, Europe, or Israel to apply. A Team is a VC-backed, stealth, application-only home on the internet for senior independent software builders to team up with hand-picked, high-growth com",
    "description": "You must be located in the Americas, Europe, or Israel to apply. A Team is a VC-backed, stealth, application-only home on the internet for senior independent software builders to team up with hand-picked, high-growth companies on their next big thing. \n After talking with hundreds of independent engineers, designers, and product folks, we heard over and over that finding vetted, high-quality, consistent clients is hard, and projects are often too small to be rewarding. A Team matches small teams of the most talented builders in the world with companies backed by a16z, YC, Softbank, General Catalyst, etc. on a contract basis for many of their most important initiatives. We quietly launched in May 2020, and have helped A Teamers earn  85+ million since. \n As part of A Team, you can expect: \n \n High-paying, meaningful missions with the most audacious companies sent your way; generally  90- 150+/hr, with vetted, fascinating clients doing work that matters. We're picky about who we partner with; new clients only come in via trusted referral. We've worked with Lyft, McGraw Hill, ClearCo, Pepsi, Walmart, the former CEO of Waze, the leading vaccine production software, several new unicorns we can't say here, and dozens of startups backed by a16z/YC/Softbank/Insight/Tiger/etc. \n Work alongside friends old &amp; new: our niche is small/diverse product teams, since clients with larger budgets and higher-impact work tell us they want teams, not individuals. Of course, we keep friends together whenever we can. \n Full autonomy: say \"no\" to things that don't excite you. The most talented builders often juggle a few things at once, so there's never pressure to join an A Team mission if you don't have the bandwidth. If we're no longer a fit, it's easy to leave or pause too. \n Small, curated, off-the-record gatherings: for conversations hard to have elsewhere. Long-term, we're creating micro-communities for the world's top builders to become friends around the things they care about. \n Keep 100% of what you earn: if you charge  120/hr, you get  120/hr. A Team makes money by charging a small, flat, transparent platform fee on top of your rate. \n \n \n \n How to apply: \n Go here: https://build.a.team/remotivereferral + mention Remotive. We respect your time so the application is short. We're also much more interested in seeing what you've made, and excited to chat more if there s a fit. \n What you ll do: \n \n \n Once part of A.Team, you ll regularly be invited to impactful missions that match your interests. Find the right pick from early-stage incubations with world-class founders, to fast-growing super-funded companies, to old school non-tech incumbents looking to build as a tech giant would \n \n \n Missions usually involve building an ambitious piece of software from 0 to 1 as part of a small 3-4 person team. \n \n \n You ll be paid to scope it out, give the client options, guide strategy, and execute on the selected solution. Sometimes the client has a clear vision, sometimes not; which is why A.Team builders tend to be senior folks who can work together to find the right direction. \n \n \n Who A   Team is for: \n \n \n Senior software developers who left large companies and high-growth startups to pursue their craft with autonomy. \n \n \n Those who prefer consistent contract work over a full-time role, who want to create a variety of new products alongside other top-tier builders. \n \n \n The majority of A.Teamers spend most of their time doing independent work, but a sizeable percentage are either employed full-time (but testing out client work), bootstrapping a side project, or looking for their next big thing \n \n \n Who A   Team is not for: \n \n \n People looking for small gigs \n \n \n Folks looking to build simple wordpress/wix/squarespace-style websites \n \n \n Those still early in their careers (&lt;4 years) and recent university/bootcamp grads (at least not yet) \n \n \n Our long-term vision: \n A Team is a new type of company for a new kind of independent software builder. We call them \"unhirables\": people who traditional companies couldn t hire full-time even if they wanted to, but who want to do their most meaningful work with their favorite people in small, autonomous, distributed expert teams. \n To help us secure amazing missions, we raised  60 million+ from Insight Partenrs, Tiger Global, NFX, RocNation, along with the former CEO of Upwork, the founders of Fiverr and Lemonade, Apple's Global Head of Recruiting, YC Partner Aaron Harris, Wharton's Adam Grant, and Duke's Dan Ariely.",
    "applyUrl": "https://remotive.com/remote-jobs/software-development/senior-independent-software-developer-1919265",
    "tags": [
      "go",
      "wordpress",
      "chat",
      "apple",
      "testing",
      "catalyst"
    ],
    "publishedAt": "2026-02-16T10:16:29",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-18T00:37:13.754Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "801a1f36-0277-4bd9-9c45-31319dcb2484",
    "source": "remotive",
    "sourceId": "2069746",
    "title": "Tech Lead Full-Stack Rails Engineer",
    "company": "Mitre Media",
    "location": "USA, Canada, USA timezones",
    "isRemote": true,
    "category": "Software Development",
    "salaryText": "$170k - $200k",
    "salaryMin": 170,
    "salaryMax": 200,
    "descriptionPreview": "About Mitre Media \n Mitre Media is redefining FinTech with AI-driven tools that empower millions of investors. Our portfolio, including Dividend.com and MutualFunds.com, leverages LLMs to deliver novel data insights and ",
    "description": "About Mitre Media \n Mitre Media is redefining FinTech with AI-driven tools that empower millions of investors. Our portfolio, including Dividend.com and MutualFunds.com, leverages LLMs to deliver novel data insights and visually rich user experiences. For over a decade, we ve served individual investors, financial advisors, and top asset managers like BlackRock and Vanguard through our premium data, tools, and advertising solutions. Join our lean, entrepreneurial team to shape the future of AI-powered investing from your location  3 hours from Eastern Time. \n Our users are deeply engaged, spending over 5 minutes per visit with a bounce rate below 10%, researching investments across hundreds of different categories. With 40 million brokerage accounts in the U.S., we take pride in building tools that make a real impact, fostering a culture of trust, innovation, and dynamism. If you re passionate about financial technology and AI, we d love to connect! \n About the Role \n As a Full-Stack Rails Tech Lead, you ll architect and implement LLM-powered web applications within our microservices-based Rails 8 platform. Reporting directly to our CTO, you ll collaborate with a small, high-impact team to deliver user experiences across Dividend.com, MutualFunds.com and other brands within our portfolio. This role combines expert Ruby on Rails skills with AI integration expertise, requiring you to leverage LLMs in your development workflow, state management and user interactions. \n You ll work in a remote-first hybrid environment, which encourages in person collaboration, using ShapeUp to manage projects that trade-off on-time delivery for de-scoped outcomes. As a technical leader, you'll have a seat at the table shaping system architecture, implementing core features all while embracing an entrepreneurial mindset and a  get things done  mentality. \n Responsibilities \n \n \n Architect and maintain Rails applications (Rails 8) \n \n \n Integrate LLMs into our microservices architecture for state management and real-time user experiences. \n \n \n Enhance front-end experiences with Hotwire, StimulusJS, or React, ensuring seamless AI-driven interactions. \n \n \n Optimize LLM inference for low latency and cost, using caching and asynchronous processing. \n \n \n Required Technical Skills \n Back-End \n \n \n Ruby (5+ years, expert-level) \n \n \n Ruby on Rails (Rails 6-8 preferred) \n \n \n PostgreSQL (or MySQL) \n \n \n Elasticsearch \n \n \n Redis \n \n \n Docker \n \n \n Front-End \n \n \n StimulusJS or JavaScript ES6 \n \n \n Tailwind CSS \n \n \n HTML \n \n \n HTTP \n \n \n AI Integration \n \n \n Experience integrating AI/ML models (e.g., LLMs, NLP) with web applications \n \n \n Familiarity with LLM frameworks (e.g., LangChain, Hugging Face) or APIs (e.g., xAI, Anthropic) \n \n \n Nice-to-Have Technical Skills \n \n \n Kubernetes for microservices orchestration \n \n \n React for advanced front-end components \n \n \n Graph databases for complex financial data \n \n \n Contributions to open-source RoR or AI projects \n \n \n Required Soft Skills \n \n \n Entrepreneurial mindset with a passion for AI and FinTech \n \n \n Natural leader who mentors and inspires teammates \n \n \n Problem-solver with a  get things done  mentality \n \n \n Excellent communication, thriving in remote and cross-team collaboration \n \n \n Attention to detail, ensuring clean, maintainable code \n \n \n Team player comfortable as an individual contributor \n \n \n Why Join Us? \n \n \n Impactful Work : Build AI-powered tools that help millions of investors make informed decisions from data-driven insights. \n \n \n Cutting-Edge Tech : Work with Rails 8, LLMs, and modern tools like Hotwire, Databricks, and xAI s API in a microservices architecture. \n \n \n Autonomy and Influence : Collaborate directly with our CEO and CTO to shape our AI-driven platform, with freedom to innovate. \n \n \n Competitive Compensation :  160,000  200,000 CAD/USD (based on experience) and benefits. \n \n \n Remote Flexibility : Remote-first ( 3 hours from ET) with hybrid in office collaboration in Toronto or NYC \n \n \n Growth Opportunities : Budget for AI and Rails conferences (e.g., NeurIPS, RailsConf), plus access to cutting-edge AI tools for experimentation. \n \n \n Dynamic Culture : Join a small, no-ego team passionate about trust, innovation, and making a difference in FinTech. \n \n \n About Mitre Media s AI-Driven Platform \n Mitre Media powers premium financial brands like Dividend.com and MutualFunds.com with the Mitre Platform. This platform integrates traditional content management, financial data, first-party data, ad revenue, and subscription tools, all enhanced by LLMs for rich, user-focused experiences. Our data-derived insights delight users, while our advertising solutions deliver unmatched performance for partners like BlackRock and Vanguard, leveraging advanced targeting and first-party data. \n How to Apply \n \n Submit your resume, GitHub profile, and a brief note on why you re excited about building AI-driven FinTech to jobs@mitremedia.com.",
    "applyUrl": "https://remotive.com/remote-jobs/software-development/tech-lead-full-stack-rails-engineer-2069746",
    "tags": [
      "api",
      "CSS",
      "docker",
      "elasticsearch",
      "fullstack",
      "html",
      "javascript",
      "kubernetes",
      "postgresql",
      "react",
      "ror",
      "ruby/rails"
    ],
    "publishedAt": "2026-02-14T20:46:44",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.689Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "3c60eb50-a83c-4d57-af4e-b99eda227b64",
    "source": "remotive",
    "sourceId": "2069747",
    "title": "Tech Lead Databricks Data Engineer",
    "company": "Mitre Media",
    "location": "USA, Canada, USA timezones",
    "isRemote": true,
    "category": "Software Development",
    "salaryText": "$160k - $180k",
    "salaryMin": 160,
    "salaryMax": 180,
    "descriptionPreview": "About Mitre Media \n Mitre Media is redefining FinTech with AI-driven tools that empower millions of investors. Our portfolio, including Dividend.com and MutualFunds.com, leverages LLMs to deliver novel data insights and ",
    "description": "About Mitre Media \n Mitre Media is redefining FinTech with AI-driven tools that empower millions of investors. Our portfolio, including Dividend.com and MutualFunds.com, leverages LLMs to deliver novel data insights and visually rich user experiences. For over a decade, we ve served individual investors, financial advisors, and top asset managers like BlackRock and Vanguard through our premium data, tools, and advertising solutions. If you re excited by the intersection of big data, AI, and investing, join our lean, entrepreneurial team from anywhere within  3 hours of Eastern Time. \n About the Role \n As Tech Lead Data Engineer, you ll architect and maintain the data backbone powering every feature across our product suite. Reporting to the CTO, you will design Databricks-based ETL pipelines, model complex investment data, and surface low-latency, high-quality datasets for both user-facing features and internal AI/analytics workloads. You ll collaborate in a remote-first hybrid culture that values in-person  bursts  of collaboration, follow ShapeUp for project planning, and ship pragmatic solutions that favor de-scoping over delays. \n Responsibilities \n \n \n Design, implement, and optimize large-scale ETL workflows in Databricks (Apache Spark, Delta Lake, DBT). \n \n \n Develop algorithms that transform raw market data into actionable insights. \n \n \n Own data quality and lineage, instituting tests, monitoring, and alerting for mission-critical pipelines. \n \n \n Evolve our cloud data platform (AWS &amp; GCP) for scale, performance, and cost efficiency. \n \n \n Mentor engineers, championing best practices in code reviews, documentation, and DevOps for data. \n \n \n Required Technical Skills \n Data Engineering \n \n \n Programming : Expert in Python plus working knowledge of Scala or Java. \n \n \n Databricks &amp; Spark : Hands-on with cluster tuning, job orchestration, and Delta Tables. \n \n \n SQL &amp; DBT : Strong analytical SQL, modular data-model design, and CI/CD for transformations. \n \n \n Cloud : Production experience on AWS or GCP data services (e.g., S3/GCS, EMR/Dataproc, Glue/Dataflow). \n \n \n ETL &amp; Orchestration : Solid grasp of EL(T) patterns, workflow scheduling, and incremental processing. \n \n \n Data Modeling : Dimensional and schema-on-read designs for analytics and AI. \n \n \n AI &amp; Analytics Enablement \n \n \n Building feature stores or inference-ready tables for ML/LLM workflows. \n \n \n Familiarity with vector databases or embedding pipelines \n \n \n Nice-to-Have Technical Skills \n \n \n Apache Airflow, Luigi, or Dagster for DAG orchestration. \n \n \n Experience with Looker, Tableau, or Stripe s Vizier-style visualization stacks. \n \n \n Financial-markets domain knowledge (equities, ETFs, mutual funds). \n \n \n Machine-learning engineering or statistical-analysis background. \n \n \n Required Soft Skills \n \n \n Entrepreneurial mindset with a passion for AI and FinTech innovation. \n \n \n Self-starter who diagnoses problems, proposes trade-offs, and delivers. \n \n \n Clear communicator who thrives in distributed, cross-functional teams. \n \n \n Mentorship attitude uplifts peers through code reviews and knowledge-sharing. \n \n \n Detail-oriented and disciplined about data accuracy and documentation. \n \n \n Why Join Us? \n \n \n Impactful Work   Your pipelines feed every insight we deliver to millions of investors. \n \n \n Cutting-Edge Tech   Databricks, Delta Lake, LLMs, Hotwire, and xAI s API, all in a modern microservices stack. \n \n \n Autonomy &amp; Influence   Work directly with the CEO &amp; CTO to shape our data and AI strategy. \n \n \n Competitive Compensation    150k    185k CAD/USD plus benefits and performance bonuses. \n \n \n Remote Flexibility   Remote-first within  3 hrs ET; optional collaboration hubs in Toronto and NYC. \n \n \n Growth Opportunities   Budget for conferences (e.g., Data+AI Summit, NeurIPS) and continuous learning. \n \n \n About Mitre Media s AI-Driven Platform \n Mitre Media powers premium financial brands like Dividend.com and MutualFunds.com with the Mitre Platform. This platform integrates traditional content management, financial data, first-party data, ad revenue, and subscription tools, all enhanced by LLMs for rich, user-focused experiences. Our data-derived insights delight users, while our advertising solutions deliver unmatched performance for partners like BlackRock and Vanguard, leveraging advanced targeting and first-party data. \n How to Apply \n \n Submit your resume, GitHub profile, and a brief note on why you re excited about building AI-driven FinTech to jobs@mitremedia.com.",
    "applyUrl": "https://remotive.com/remote-jobs/software-development/tech-lead-databricks-data-engineer-2069747",
    "tags": [
      "apache",
      "api",
      "AWS",
      "big data",
      "cloud",
      "java",
      "python",
      "scala",
      "sql",
      "AI/ML",
      "documentation",
      "CAD"
    ],
    "publishedAt": "2026-02-14T20:46:35",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.690Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "bbe7bd00-d938-493b-885e-3ed82bc0ce58",
    "source": "remotive",
    "sourceId": "2087694",
    "title": "AI Trainer",
    "company": "Anuttacon",
    "location": "Worldwide",
    "isRemote": true,
    "category": "AI / ML",
    "salaryText": "",
    "salaryMin": null,
    "salaryMax": null,
    "descriptionPreview": "Our Culture: \n \n Our culture thrives on creativity, communication, and collaboration. Around here, the work is the game. You ll have fun, make real connections, and actually see the impact of what you do. \n \n \n \n \n    Ab",
    "description": "Our Culture: \n \n Our culture thrives on creativity, communication, and collaboration. Around here, the work is the game. You ll have fun, make real connections, and actually see the impact of what you do. \n \n \n \n \n    About Us: \n \n Anuttacon s mission is to create immersive and personalized virtual worlds where players can form unique connections and deeper experiences in digital spaces. We are dedicated to leveraging different perspectives, voices, and backgrounds to promote a thoughtful and humanistic approach to technology. Through research-driven and explorative AI, we aim to create real-time interactions that seamlessly blend text, audio, visuals and beyond. \n \n    About the Role: \n \n We re looking for individuals with diverse expertise to join our data team as AI Trainers. In this role, you will directly be involved in improving the accuracy and performance of our models. \n \n \n    Responsibilities: \n \n \n Annotate content in a variety of media to support game design, such as dialogues, quests, character interactions, and scenes \n Ensure accuracy and consistency in the data to optimize players  gaming experience \n Support in-depth world building, comprehensive characters, mini-plots, personality profiles, and other relevant details \n Annotate and evaluate model responses against our evaluation rubrics in an effort to improve dialogue and overall interactions to achieve the best user experience possible \n Collaborate with our research and product teams to develop state-of-the-art large language models \n \n \n    About You: \n \n \n Native or fluent in English \n Have a passion for gaming, especially those experienced in narrative games \n Strong attention to detail and a commitment to producing high-quality work in a flexible, dynamic environment \n Ability to follow complex guidelines and apply them consistently \n Good communication skills; able to give and receive feedback effectively \n \n \n    Nice to Haves: \n \n \n Degree and/or experience in the following fields are a plus: \n Storytelling, creative writing, copywriting, or content development \n Media, film, video, audio, or narrative design \n Performing arts, voice work, or expressive presentation \n Marketing, communications, or audience engagement \n Psychology, philosophy, or other fields focused on human behavior and thought \n STEM di sciplines with a strong emphasis on clarity and structure \n Previous experience working with AI/ML concepts or working with data analysis, data manipulation, data reporting. \n \n \n    Compensation &amp; other expectations: \n \n \n US Hourly rate:  25 (but depending on your role and qualifications). Compensation varies based on location and experience. International rates will differ. \n Able to dedicate 20-40+ flexible hours per week based on your availability \n There will be exciting opportunities for bonus and growth!",
    "applyUrl": "https://remotive.com/remote-jobs/ai-ml/ai-trainer-2087694",
    "tags": [
      "video",
      "AI/ML",
      "research",
      "game design",
      "data analysis",
      "STEM",
      "R",
      "narrative design"
    ],
    "publishedAt": "2026-02-12T21:01:01",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.690Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "33ab241f-8990-40de-8c1d-b46e1bc9e8de",
    "source": "remotive",
    "sourceId": "1680495",
    "title": "Office Assistant",
    "company": "Coalition Technologies",
    "location": "Worldwide",
    "isRemote": true,
    "category": "Marketing",
    "salaryText": "$31,2k- $52k",
    "salaryMin": 52,
    "salaryMax": 312,
    "descriptionPreview": "WHY YOU SHOULD APPLY: \n \n Coalition Technologies is devoted to delivering clients the highest quality work while providing our team a fun, thriving, and innovative environment. Along with the opportunity for tremendous c",
    "description": "WHY YOU SHOULD APPLY: \n \n Coalition Technologies is devoted to delivering clients the highest quality work while providing our team a fun, thriving, and innovative environment. Along with the opportunity for tremendous career growth and rapid advancement, CT offers: \n \n The most competitive profit-sharing bonus plan in the industry, paying up to 50% of company profits to full-time employees each month! \n A highly competitive Paid Time Off plan, promoting quality work-life balance. \n Subsidized gym memberships to help team members feel their best. \n Medical, dental, vision, and life insurance packages for all US-based team members. \n International Health Insurance Reimbursement Program for all international team members, a benefit unique to Coalition. \n Device upgrade and learning reimbursement programs. \n Motivating career development plans with clearly defined goals and rewards. \n Additional job-specific incentives and bonuses. \n \n Plus, 100% of our team works remotely with the support of time tracking software. Our company culture specializes in supporting remote team members, and we ve been doing so for more than a decade. CT welcomes your application, wherever in the world it's coming from! \n \n YOU SHOULD HAVE: \n \n \n Willingness to learn, grow, and collaborate with the team and company as a whole. Excellent verbal and written communication skills. A high level of discretion, ethics, and trustworthiness. Intermediate spreadsheet skills (preferred) Innovative thinking and a willingness to challenge existing methods where improvement is possible. Experience in bookkeeping / financial record keeping (preferred). Experience with Google Sheets or Excel, Quickbooks Online, and G-Suite (preferred). The availability to work 40 hours per week from 9:00 am to 6:00 pm PST. A reliable space to work remotely with a fast computer, quality internet, camera, microphone, and speakers. \n \n \n YOUR DUTIES AND TASKS: \n \n \n Answering phones and emails. Completing entry-level bookkeeping, including recording expenses, organizing receipts, and completing other transaction records. Resolving billing issues with clients and internal team members. Providing account access, usage reports, data analysis, and other ad hoc requests for team members. Supporting quality assurance checks of various internal and client facing reporting. Organizing new client contracts, create invoices, and process client payments. Contributing to internal database maintenance, upkeep and data entry. Researching, ordering, &amp; distributing company-wide gifts (2-3 times per year). Organizing company events, competitions, and special projects throughout the year. Facilitating company holiday, time off, and schedule variation calendars. \n \n \n We are looking for talented and diligent candidates who excel in our skills tests, and will consider these candidates even if past experience or educational background criteria aren't met. \n \n *California, New York, Washington, and Colorado: starting base pay for this position ranges between  15 -  25 per hour. \n Compensation may vary based on factors such as experience, qualifications, skills test performance, geographic location, and seniority of the position offered. Outside of California, New York, Washington, and Colorado compensation may fall outside the above ranges.",
    "applyUrl": "https://remotive.com/remote-jobs/marketing/office-assistant-1680495",
    "tags": [
      "CSS",
      "excel",
      "frontend",
      "git",
      "html",
      "illustrator",
      "magento",
      "photoshop",
      "php",
      "shopify",
      "wordpress",
      "MySQL"
    ],
    "publishedAt": "2026-02-11T20:16:31",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.690Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "2cb3b1f7-b6eb-47a7-81c0-2442088a7d85",
    "source": "remotive",
    "sourceId": "1956455",
    "title": "iOS Developer",
    "company": "nooro",
    "location": "USA",
    "isRemote": true,
    "category": "Software Development",
    "salaryText": "$60k-$130k (depending on experience)",
    "salaryMin": 60,
    "salaryMax": 130,
    "descriptionPreview": "WHO ARE WE? \n \n At nooro, we're revolutionizing pain management for seniors. Our platform is transforming how older adults engage with pain management at home. We're on a mission to make wellness more accessible and effe",
    "description": "WHO ARE WE? \n \n At nooro, we're revolutionizing pain management for seniors. Our platform is transforming how older adults engage with pain management at home. We're on a mission to make wellness more accessible and effective through technology. \n \n Check our website here: https://nooro-us.com/ \n \n We're a fast-moving startup that works on quick iteration and bold decisions. Our team is lean, agile, and empowered to make meaningful impacts daily. If you enjoy a dynamic environment where ideas become a reality at lightning speed and you're not afraid to wear multiple hats, you'll fit right in. \n \n WHAT WILL YOU DO? \n \n - Own and drive the development of our iOS application \n - Build elegant, performant features using **Swift (We re 100% Swift!)** and **SwiftUI** \n - Implement complex UI/UX designs from **Figma** with pixel-perfect accuracy \n - Ensure app performance, quality, and responsiveness \n - Collaborate with our backend team on API integration \n - Write clean, modular, and reusable code \n - Participate in code reviews and architectural decisions \n - Help shape our mobile development practices \n \n HOW TO APPLY? \n \n If you believe we're the right fit, please fill in this form: https://forms.gle/xeL6pPbdjMHo11A28 \n \n WHAT ARE THE REQUIREMENTS? \n \n - 5+ years of professional iOS development experience \n - Strong expertise in Swift and SwiftUI \n - Deep understanding of iOS platform capabilities and limitations \n - Experience with iOS app architecture (MVVM preferred) \n - Experience with Core Data and local storage solutions \n - Proficiency in making RESTful API calls and handling responses \n - Experience with dependency injection on iOS \n - Strong version control skills with Git/GitHub \n - Experience with App Store deployment and TestFlight \n - Knowledge of iOS security best practices \n \n APPLYING PROCESS \n \n STEP 1 | QUESTIONNAIRE: If you believe we're the right fit, please fill in this form: https://forms.gle/xeL6pPbdjMHo11A28 \n \n STEP 2 | TEST: Once we review your form submission, we will send you a test \n \n STEP 3 | TECHNICAL INTERVIEW: Once we review your test submission, you will have a call with our development leader \n \n STEP 4 | BEHAVIORAL INTERVIEW: After the technical interview, you will have a call with our CEO to talk about the way our company and team members operate in general \n \n WHAT DO WE OFFER? \n \n - 100% remote work environment \n - Competitive compensation \n - Opportunity to make a meaningful impact in healthcare technology \n - Collaborative, innovative team culture",
    "applyUrl": "https://remotive.com/remote-jobs/software-development/ios-developer-1956455",
    "tags": [
      "api",
      "backend",
      "git",
      "ios",
      "security",
      "swift",
      "UI/UX",
      "Figma",
      "agile",
      "healthcare",
      "startup",
      "core data"
    ],
    "publishedAt": "2026-02-09T21:15:55",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.690Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "c9d5aa56-cffe-4dce-b6a2-a1fec3e96cd3",
    "source": "remotive",
    "sourceId": "2086540",
    "title": "Inside Sales Contractor",
    "company": "Credit Wellness, LLC",
    "location": "Worldwide",
    "isRemote": true,
    "category": "Sales / Business",
    "salaryText": "OTE $25k - $35k",
    "salaryMin": 25,
    "salaryMax": 35,
    "descriptionPreview": "About Us \n We are a financial services start up focusing on helping to improve consumer credit profiles. We are currently seeking KPI driven sales representatives looking to earn up to 45K in their first year while worki",
    "description": "About Us \n We are a financial services start up focusing on helping to improve consumer credit profiles. We are currently seeking KPI driven sales representatives looking to earn up to 45K in their first year while working remotely. We offer comprehensive training and continuous sales coaching to help you meet your financial goals. \n During our training period we offer a guaranteed training stipend while our trainees are acclimating to the position (*see weekly pay below). If you are a seasoned sales professional looking for the autonomy of a remote position combined with great compensation, we want to hear from you! \n Compensation Structure \n This role is 100% commission-based , which means your earning potential is unlimited. In addition, we regularly offer competitive performance-based bonuses to reward hard work and results. \n Training Period (Weeks 1 4) \n We invest in your success and want to make sure you re supported as you get up to speed: \n \n \n Week 1: Commission-only (a chance to start earning right away while learning the ropes). \n \n \n Weeks 2 4: Guaranteed training stipend of  1,000 total   or your commission if it s higher. You ll always receive whichever amount benefits you most. \n \n \n \n Week 2:  250 guaranteed minimum \n \n \n Week 3:  325 guaranteed minimum \n \n \n Week 4:  425 guaranteed minimum \n \n \n \n By the end of training, you ll have the skills to maximize commissions, with the safety net of a guaranteed base during your ramp-up period. \n Post Training Period: \n \n \n Average first year OTE: 25K-35K (US) Annually \n \n \n Top Rep first year OTE: 35K-45K (US) Annually \n \n \n *The above is the average pay you can expect, however, there is unlimited earning potential for those who are financially motivated top performers looking to exceed sales targets. \n What will you be doing? \n Educating inbound callers on their credit standing by providing consultations with the goal of enrolling them in one of our services should they be a good fit. \n We are looking for team members who are: \n \n \n Tech savvy with the ability to navigate digital tools such as SLACK, CRM software, google sheets, etc. Our team uses these digital tools daily. \n \n \n Growth oriented and always looking to learn and acquire new skills. \n \n \n Autonomous self starters who can work independently and efficiently. \n \n \n Team players with the ability to implement feedback from their sales coaches. \n \n \n Patient and professional with clients. Finances can be a difficult topic for some clients to discuss. We are looking for individuals who showcase empathy and professionalism especially under pressure! \n \n \n Financially motivated individuals who can meet and exceed sales targets. \n \n \n Outgoing with outstanding rapport building and active listening skills. Can you carry a conversation with anyone? This may be for you! \n \n \n You will need: \n \n \n Home office or a quiet place to work. \n \n \n Strong internet connection. \n \n \n Desktop or laptop \n \n \n (*Please Note: Devices such as Chromebooks, IPADs and laptops with 8G s of RAM and under will have issues supporting our system) \n Scheduling \n Training: The schedule for the first two weeks of our training period is 10 AM - 6 PM EST. \n *The first week of training is mandatory for all new trainees. If a day is missed you may be asked to restart the first week of training. \n Post Training: \n We are currently seeking representatives to work on the following schedule: \n Monday - Friday \n Shift hours to be discussed with our hiring manager based on our company's needs at the time of hire. Shifts are as follows: \n \n \n 8:00 AM - 4:00 PM EST \n \n \n 8:30 AM - 4:30 PM EST \n \n \n 9:00 AM - 5:00 AM EST \n \n \n 9:30 AM - 5:30 PM EST \n \n \n 10:00 AM - 6:00 PM EST \n \n \n 10:30 AM - 6:30 PM EST \n \n \n 11:00 AM - 7:00 PM EST \n \n \n 11:30 AM - 7:30 PM EST \n \n \n 12:30 PM - 8:30 PM EST \n \n \n 1:30 PM - 9:30 PM EST \n \n \n 2:30 PM - 10:30 PM EST \n \n \n 3:00 PM - 11:00 PM EST \n \n \n Job Type: Contract \n Shift: \n \n \n 8 hour shift \n \n \n Day shift \n \n \n Evening shift \n \n \n Morning shift \n \n \n Night shift \n \n \n Supplemental Pay: \n \n \n Bonus opportunities \n \n \n Commission pay \n \n \n Experience: \n \n \n Sales: 1 year (Required) \n \n \n Work Location: Remote",
    "applyUrl": "https://remotive.com/remote-jobs/sales-business/inside-sales-contractor-2086540",
    "tags": [
      "CRM",
      "google sheets",
      "financial services",
      "Inside Sales"
    ],
    "publishedAt": "2026-02-08T22:01:13",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.690Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "609a05e9-455c-4522-b790-72e114b942a0",
    "source": "remotive",
    "sourceId": "2088624",
    "title": "Senior Python Backend Developer",
    "company": "SKYCATCHFIRE",
    "location": "USA",
    "isRemote": true,
    "category": "Software Development",
    "salaryText": "$100k - $150k",
    "salaryMin": 100,
    "salaryMax": 150,
    "descriptionPreview": "About the job We transform successful businesses by turning their proven processes into powerful software systems. We're looking for developers who take pride in crafting solutions that help these businesses grow. Do you",
    "description": "About the job We transform successful businesses by turning their proven processes into powerful software systems. We're looking for developers who take pride in crafting solutions that help these businesses grow. Do you... find satisfaction in designing systems that bring order to complex business operations? take pride in building robust architectures that scale reliably? excel at modeling complex business processes into elegant data structures? enjoy deeply understanding business problems before crafting solutions? Are you... someone who enjoys mastering your tools and continuously improving? detail-oriented with an eye for systematic approaches? comfortable owning projects from start to finish? drawn to building solutions that create order from complexity? Here's what makes our work different We're not just building software   we're creating systems that transform how businesses operate. Our clients trust us to understand their complex processes and turn them into elegant, efficient solutions. Join a team of other self-motivated individuals who excel at their craft. We take pride in the work we do and get excited about solving problems. We only hire self-motivated \"drivers\" and developers with lots of experience. You'll join a team that values Time to think through solutions properly Deep understanding of business processes Consistent, high-quality execution Protected focus time for complex challenges Long-term reliability over quick fixes Your Day-to-Day Design and build robust backends that power business transformation Create sophisticated data models that reflect complex business rules Develop reliable integrations between modern and legacy systems Build powerful APIs that connect disparate business systems Implement secure, scalable solutions for business-critical operations Experience Required Strong Python backend experience with at least one major framework (Django preferred, FastAPI/Flask acceptable) Strong background in Python and API design Reflexive use of all types of AI tools to work faster and smarter Experience building and maintaining large-scale applications Excellence in database design and optimization Understanding of complex data modeling and migrations Clear written communicator that prefers emails to meetings Portfolio showing systematic, well-structured work Bonus Points Experience building AI-powered tools (RAG, LLM, etc.) Experience building ERP/CRM systems React/Next.js familiarity Business process automation experience Data integration and ETL knowledge Mad /giphy skills on Slack (or a desire to learn) The Environment Stable, focused work environment Protected development time Regular, predictable schedule Email &gt; meetings",
    "applyUrl": "https://remotive.com/remote-jobs/software-development/senior-python-backend-developer-2088624",
    "tags": [
      "api",
      "backend",
      "django",
      "excel",
      "python",
      "react",
      "AI/ML",
      "automation",
      "CRM",
      "flask",
      "business operations",
      "ETL"
    ],
    "publishedAt": "2026-02-06T22:41:25",
    "matchScore": 20,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.690Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "94b1c1ec-2220-4b1d-abff-0396f0ca55b3",
    "source": "remotive",
    "sourceId": "2088622",
    "title": "Content Reviewer",
    "company": "TELUS Digital",
    "location": "USA",
    "isRemote": true,
    "category": "All others",
    "salaryText": "14$/hour",
    "salaryMin": 14,
    "salaryMax": 14,
    "descriptionPreview": "Looking for a freelance opportunity where you can make an impact on technology from the comfort of your home? If you are dynamic, tech-savvy, and always online to learn more, this part-time flexible project is the perfec",
    "description": "Looking for a freelance opportunity where you can make an impact on technology from the comfort of your home? If you are dynamic, tech-savvy, and always online to learn more, this part-time flexible project is the perfect fit for you! \n \n A Day in the Life of a Personalized Internet Assessor: \n \n \n   In this role, you ll be analyzing and providing feedback on texts, pages, images, and other types of information for top search engines, using an online tool \n \n   Through reviewing and rating search results for relevance and quality, you ll be helping to improve the overall user experience for millions of search engine users, including yourself. \n \n \n \n Join our team today and start putting your skills to work for one of the world's leading search engines. \n \n \n The estimated hourly earnings for this role are 14 USD per hour. \n \n Please note only one member per household can work on this program. If at a later stage it is identified that more than one person in your household is working on the TELUS Digital Rating Program, it will result in removal from the program. \n \n \n \n TELUS Digital AI Community \n \n \n Our global AI Community is a vibrant network of 1 million+ contributors from diverse backgrounds who help our customers collect, enhance, train, translate, and localize content to build better AI models. Become part of our growing community and make an impact supporting the machine learning models of some of the world s largest brands. \n \n \n \n Qualification path \n \n No previous professional experience is required to apply to this role, however, working on this project will require you to pass the basic requirements and go through a standard assessment process. This is a part-time long-term project and your work will be subject to our standard quality assurance checks during the term of this agreement. \n \n \n \n Basic Requirements \n \n \n   Working as a freelancer with excellent communication skills in English \n \n   Being a resident in the United States for the last 3 consecutive years and having familiarity with current and historical business, media, sport, news, social media, and cultural affairs in the US. \n \n   Active use of Gmail and other forms of social media and experience in the use of web browsers to navigate and interact with a variety of content \n \n   Daily access to a broadband internet connection, a smartphone (Android 5.0, iOS 14 or higher), and a personal computer to work on. \n \n \n \n Assessment \n \n \n In order to be hired into the program, you ll take a language assessment and an open book qualification exam that will determine your suitability for the position and complete ID verification. Don t worry, our team will provide you with guidelines and learning materials before your exam. You will be required to complete the exam in a specific timeframe but at your convenience! \n \n \n \n Equal Opportunity \n \n \n \n All qualified applicants will receive consideration for a contractual relationship without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. At TELUS Digital AI, we are proud to offer equal opportunities and are committed to creating a diverse and inclusive community. All aspects of selection are based on applicants  qualifications, merits, competence, and performance without regard to any characteristic related to diversity",
    "applyUrl": "https://remotive.com/remote-jobs/all-others/content-reviewer-2088622",
    "tags": [
      "android",
      "go",
      "ios",
      "social media",
      "AI/ML",
      "diversity"
    ],
    "publishedAt": "2026-02-06T16:14:35",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.690Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "3c4c27c8-3c8d-4bdd-a8ad-a29809984579",
    "source": "remotive",
    "sourceId": "1185979",
    "title": "Freelance Writer",
    "company": "IAPWE",
    "location": "Worldwide",
    "isRemote": true,
    "category": "Writing",
    "salaryText": "$50-$75 /hour",
    "salaryMin": 50,
    "salaryMax": 75,
    "descriptionPreview": "Our organization is seeking content writers to create articles and blog posts on a variety of topics. \n \n The rate of pay is  20 per 100 words (this comes out to approximately  100 per article or  50 per hour). \n \n Some ",
    "description": "Our organization is seeking content writers to create articles and blog posts on a variety of topics. \n \n The rate of pay is  20 per 100 words (this comes out to approximately  100 per article or  50 per hour). \n \n Some topics you may be asked to write about include the following (you can always turn down a topic if you do not feel comfortable writing about it, however if you have experience or expertise in a specific area, please let us know): \n \n \n Health &amp; beauty \n Fitness \n Home Decor \n Fashion \n Sports \n Do it yourself \n Finance \n Legal \n Medical \n Family/Parenting \n Relationships \n Real Estate \n Restaurants \n Contracting (plumbing, pool building, remodeling, etc.) \n \n \n These are just some of the more general industries and topics that we cover. \n \n Requirements : \n \n We ask that all work be completed using a word processor such as Microsoft Word or Open Office \n A reliable internet connection and the ability to meet deadlines \n Good communication skills and respond in a timely manner to editorial staff when they ask for updates on tasks, etc \n Work well as a team member with the rest of our content management and editorial staff \n \n Note : Applicants to this job signaled that accessing some writing tasks may require payment.",
    "applyUrl": "https://remotive.com/remote-jobs/writing/freelance-writer-1185979",
    "tags": [
      "REST"
    ],
    "publishedAt": "2026-02-04T17:01:32",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.690Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "ff0adb0e-6fd6-45c3-b0df-a8a5fb108b7b",
    "source": "remotive",
    "sourceId": "2088618",
    "title": "AI Internet Rater",
    "company": "Welo Data",
    "location": "USA",
    "isRemote": true,
    "category": "AI / ML",
    "salaryText": "$14.5/hour",
    "salaryMin": 5,
    "salaryMax": 14,
    "descriptionPreview": "OVERVIEW \n \n Welo Data is looking for English speakers to join a remote project as a Search Quality Rater. In this role, you will help improve how search engines understand and deliver useful results to users. \n \n What y",
    "description": "OVERVIEW \n \n Welo Data is looking for English speakers to join a remote project as a Search Quality Rater. In this role, you will help improve how search engines understand and deliver useful results to users. \n \n What you ll do: \n \n \n Review search results and evaluate how helpful and relevant they are to the user s query \n Answer simple true/false questions about the quality of content \n Rate whether search results meet the user s needs using clear guidelines \n Complete straightforward online tasks that contribute to improving AI systems \n \n \n No specialized technical experience is required - we provide the guidelines and support you need to succeed! \n \n Please click here for a short demo of these types of tasks: What Does a Search Quality Rater Do? (youtube.com) \n \n Why this work matters: \n Your feedback helps train and improve AI technology, making search engines smarter and more useful for people around the world. \n \n Schedule &amp; Support: \n Fully remote position \n Set your own schedule and complete tasks when it s convenient for you \n Support is available from the project management team during business hours (Monday Friday, 9:00 AM   5:30 PM Pacific) \n \n \n Project Details \n \n Job Title: AI Internet Rater/Search Quality Rater \n Location: Remote, US-based \n Hours: Minimum 10 hours per week, up to 29 hours per week; set your own schedule \n Start date: ASAP \n Employment Type: W2 Part-Time Employee, payment every 2 weeks \n Longevity of project: 12 months (with possibility of extension). \n \n This work is based on project needs. Weekly hours may vary. \n \n Benefits \n Employee Assistance Program \n \n Following eligibility requirements \n Paid Sick Time \n Medical Insurance \n Dental Insurance \n Vision Insurance \n HSA \n Voluntary Life Insurance \n Accident, Critical Illness, Hospital Indemnity Insurance \n 401(k) Retirement Plan \n \n Currently hiring in: Alabama, Florida, Georgia, Indiana, Kansas, Kentucky ,Missouri ,Montana, New Hampshire, North Carolina, Ohio, Oklahoma, Pennsylvania ,South Carolina, Tennessee, Texas, Utah, Virginia, West Virginia, Wisconsin. \n \n Applicants must be of at least 18 years of age to apply.",
    "applyUrl": "https://remotive.com/remote-jobs/ai-ml/ai-internet-rater-2088618",
    "tags": [
      "AI/ML",
      "project management",
      "insurance"
    ],
    "publishedAt": "2026-02-04T08:43:19",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.691Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "87f2eb40-4182-4603-a513-f989866c1895",
    "source": "remotive",
    "sourceId": "1749306",
    "title": "Copywriter",
    "company": "Coalition Technologies",
    "location": "Worldwide",
    "isRemote": true,
    "category": "Writing",
    "salaryText": "$20k -$35k",
    "salaryMin": 20,
    "salaryMax": 35,
    "descriptionPreview": "WHO WE'RE LOOKING FOR \n The ideal copywriter has excellent English writing skills and is excited to write high-quality, SEO-driven content that aligns with detailed, client-specific guidelines. Projects most commonly inc",
    "description": "WHO WE'RE LOOKING FOR \n The ideal copywriter has excellent English writing skills and is excited to write high-quality, SEO-driven content that aligns with detailed, client-specific guidelines. Projects most commonly include writing web pages for eCommerce and lead generation business sites such as category pages, product descriptions, and blog posts. Our clientele is constantly evolving. We produce content for these and many other industry verticals: \n \n Fashion (both mass-market and luxury) \n Skincare &amp; Beauty \n Tech &amp; Software** \n Finance &amp; Investing** \n Law (family law, product liability, divorce, etc.)** \n Education \n Home Improvement \n Automobiles &amp; Motorcycles (OEM and aftermarket accessories) \n Health and Wellness** \n Medical / Clinical** \n Digital Marketing \n SEO / PR / Advertising / Marketing** \n **Writers with a background in these highly specialized fields are strongly encouraged to apply. \n The ideal candidate for this position is a multifaceted technical and creative writer with at least two to four years of professional, non-academic experience. Candidates should understand how to write content that effortlessly blends SEO best practices and brand priorities for finished work that s engaging, creative, and ROI-driven. Candidates should also be willing and able to complete careful research in order to gain a strong understanding of various industries. Candidates should be prepared to provide portfolios featuring published work. Once an offer has been extended, writers will be asked to take a brief training course. \n \n Compensation \n Writers are paid on a per-word basis. The rate is assessed according to our KPI rubric (key performance indicators) with an automatic raise after 400 and 800 pages have gone live on our client's websites. \n Initial compensation is up to  0.06 per word with  0.034 per word being the most typical compensation level. This is  30 or  17 per page of 500 words. \n After 400 pages live, the top marginal rate increases to  0.064 per word with the most typical rate of  0.038 per word, or  32 and  19 per page. After 800 pages live, the top marginal rate increases to  0.07 per word with  0.044 per word being the most typical, or  35 and  22 per page.",
    "applyUrl": "https://remotive.com/remote-jobs/writing/copywriter-1749306",
    "tags": [
      "accounting",
      "excel",
      "research",
      "data analysis",
      "bookkeeping",
      "google sheets",
      "quickbooks",
      "data entry",
      "insurance",
      "G Suite"
    ],
    "publishedAt": "2026-02-02T20:00:50",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.691Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "5ee4927f-861b-4876-8671-e0812d5d3661",
    "source": "remotive",
    "sourceId": "2082736",
    "title": "Senior Amazon Brand Manager",
    "company": "GNO Partners",
    "location": "Worldwide",
    "isRemote": true,
    "category": "Marketing",
    "salaryText": "$220k-$300k OTE",
    "salaryMin": 220,
    "salaryMax": 300,
    "descriptionPreview": "Why Join Us? \n \n Fully remote Amazon consulting agency. \n High-performance culture: hard work, speed, over-delivery, and trust. \n Competitive Compensation: Total OTE of  220,000- 300,000+. \n \n Base Salary:  120,000 \n Per",
    "description": "Why Join Us? \n \n Fully remote Amazon consulting agency. \n High-performance culture: hard work, speed, over-delivery, and trust. \n Competitive Compensation: Total OTE of  220,000- 300,000+. \n \n Base Salary:  120,000 \n Performance-Based Earnings: Realistically getting an extra  180,000 per year based on performance, and more (no cap). \n \n \n \n \n Work with a team that lives and breathes Amazon while having fun doing it. \n \n \n Who We re Looking For: \n We are seeking a Senior Amazon Brand Manager who deeply understands Amazon FBA, enjoys strategizing for brand growth, and can tackle complex challenges with precision and speed . \n \n Key Skills &amp; Experience: \n \n Organic Ranking Mastery : Product launches, ranking strategies, and algorithm insights. \n Amazon PPC Expertise: Strategy + execution, proven hands on experience managing minimum  50K+/mo budgets . \n Brand Management: Experience managing Private Label brands generating a minimum of  10M in annual revenue \n Logistics &amp; Backend: Strong grasp of COGs, fees, inventory, and profitability (P&amp;L) optimization . \n Amazon Catalog Troubleshooter: Proven expertise in diagnosing and resolving complex catalog issues. \n \n \n Responsibilities: \n \n Lead weekly strategy calls with clients, ensuring project progress. \n Solve Amazon challenges and guide clients through key projects. \n Track progress and provide clear next steps. \n Offer daily support via Slack &amp; Email. \n Continuously improve our consulting systems. \n Attend weekly training and team meetings. \n \n \n Qualifications: \n \n Full-time, remote. \n 3+ years Amazon FBA experience , managing brands  10M+ in revenue minimum. \n PPC expertise: Managed  50k monthly ad budgets minimum . \n Seller Central pro: Navigate and optimize quickly. \n Strong project management &amp; client communication skills. \n Positive, proactive, and client-focused personality. \n Fluent in English. \n Ambitious and driven, with a relentless work ethic to maximize earning potential \n \n \n If you're an Amazon expert, you're driven, strategic, and thrive in high-growth environments, we want you on our team! \n Please submit your application through Breezy HR:    https://gno-partners.breezy.hr/p/154fdc8fa066-senior-amazon-brand-manager?state=published \n \n \n *For referrals, email us at HR @ gnopartners.com and CC the candidate you re introducing.",
    "applyUrl": "https://remotive.com/remote-jobs/marketing/senior-amazon-brand-manager-2082736",
    "tags": [
      "amazon",
      "backend",
      "project management",
      "PPC"
    ],
    "publishedAt": "2026-01-26T07:45:51",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.691Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "e96f88bb-35c7-44d6-8f53-74f97fc1e99f",
    "source": "remotive",
    "sourceId": "2088612",
    "title": "Product, Platform & Enterprise Full Stack Sr/Staff Software Engineer",
    "company": "BNSF Railway",
    "location": "USA",
    "isRemote": true,
    "category": "Software Development",
    "salaryText": "$165,000 - $300,000",
    "salaryMin": 165000,
    "salaryMax": 300000,
    "descriptionPreview": "The range represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role. Individual compensation and level of position offered is determined by t",
    "description": "The range represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role. Individual compensation and level of position offered is determined by the hiring location and additional factors including but not limited to job-related skills, experience, and relevant education or training. In addition to base pay and bonus eligibility, BNSF offers a comprehensive benefits package. This is a full-time remote position. Employees may work from anywhere within the contiguous 48 states of the United States \n \n Travel is up to 20%. Employees will be required to occasionally travel to our corporate headquarters in Fort Worth, TX for in person meetings. Travel expenses for business needs will be covered by BNSF \n \n This position is open to candidates who are currently authorized to work in the United States. We are also open to sponsoring H-1B transfers, TN nonimmigrant status, and STEM OPT candidates with at least 2 years of remaining eligibility. \n \n Apply early as this job may be removed or filled prior to the closing date, which is approximately seven (7) days after the posting date. \n \n \n product engineering: bridge the gap between vision and reality by transforming complex rail logistics and workflows into high-performing products that meet user needs, enhance efficiency and accelerate our business. \n \n platform engineering: develop software platforms that enable our product and business teams to be able to develop applications that serve our customers through use of reusable and scalable software services operating with high efficiency . Our platform engineers build software and deliver innovative services that can scale and make other engineering organizations to leverage platforms to enable speed to market. \n \n enterprise engineering: empower the workforce with cutting-edge collaboration tools and services. Our enterprise engineers boost productivity, enhance mobility and ensure reliable systems for finance, human resources legal operations and more. \n \n Key responsibilities may include: \n As an engineer in our teams, you will have the opportunity to own and deliver highly visible, innovative projects that directly impact our railroad logistics to effectively serve our customers to move freight on time. You will be involved in driving the technical and architectural vision for a core team that develops software for our core freight movement operations, as well as all the aspects of the software development cycle including scoping, design, implementation, testing &amp; delivery of our product. \n \n This is a full-stack engineering role, focused on building and operating platform services such as messaging systems, micro-services, data platforms, serverless runtimes, customer experiences and applying AI/ML to develop scalable and highly reliable solutions. \n \n Develop APIs, automation, and tools to improve platform integration. \n Build and maintain monitoring and alerting systems for services. \n Collaborate with application teams to enhance reliability and performance. \n Design and operate scalable systems across data centers, edge devices, and the cloud. \n Work with BNSF teams to create products that improve rail network operations. \n Innovate in distributed computing and drive industry transformation. \n Build solutions for high-speed, large-scale predictions on distributed systems. \n Solve broad challenges by designing and coding effective solutions in an agile environment. \n Own architecture for large-scale, complex systems. \n Make critical technical decisions balancing business needs and engineering trade-offs. \n Drive cross-team alignment on technical solutions. \n Establish and maintain coding and design best practices \n Serve as a subject matter expert in one or more technical domains. \n Mentor and grow other engineers, including other senior engineers. \n Anticipate technical risks and design systems to mitigate them. \n The duties and responsibilities in this posting are representative categories to be used in deciding whether to apply for this position. This is not an exhaustive list of the position s duties. \n At BNSF Railway, we encourage individuals from all backgrounds to apply, showcasing their skills, experiences and development. We provide resources and tools to help you reach your full potential, fostering a supportive and inclusive environment. \n \n Basic Qualifications \n \n Authorized to work in the US \n Minimum 6 years of software development or related experience \n 6+ years of programming experience with at least one software programming language \n Experience with distributed systems and use of technologies such as messaging frameworks (i.e. Kafka and RabbitMQ), API gateways, SQL/NoSQL/Graph databases, caching systems, and serverless platforms \n Experience with CI/CD pipelines, Git workflows, and DevOps practices \n Interest in open-source platform and infrastructure technologies \n Familiarity with observability stacks (e.g., Prometheus, Grafana, OpenTelemetry) \n Experience with secure coding practices and platform security principles \n Ability to work in cross-functional teams and communicate with stakeholders \n Experience participating in design reviews, incident retrospectives, or RFC processes \n Demonstrated ability to learn new technical concepts and to adapt to new technologies quickly \n Strong communication and collaboration skills \n Experience as a mentor, or a tech lead in an engineering team \n \n \n Preferred Qualifications \n \n Bachelor s degree or higher in computer science, or related field \n Engineering experience with a public PaaS or cloud provider (AWS, Azure or GCP) \n Experience developing and operating large scale distributed systems in Production \n Experience with serverless runtimes and event-driven architectures \n Familiarity with developer tooling as a builder and/or user \n Interest in sustainable infrastructure and cost/resource awareness \n Experience with single-pane-of-glass managemen",
    "applyUrl": "https://remotive.com/remote-jobs/software-development/product-platform-enterprise-full-stack-sr-staff-software-engineer-2088612",
    "tags": [
      "api",
      "AWS",
      "azure",
      "cloud",
      "fullstack",
      "git",
      "kafka",
      "node.js",
      "react",
      "security",
      "sql",
      "AI/ML"
    ],
    "publishedAt": "2026-01-24T14:35:10",
    "matchScore": 20,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.691Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "664c7611-0867-4031-be71-4ed14fb53f4c",
    "source": "remotive",
    "sourceId": "2088611",
    "title": "Product, Platform & Enterprise Front End Sr/Staff Software Engineer",
    "company": "BNSF Railway",
    "location": "USA",
    "isRemote": true,
    "category": "Software Development",
    "salaryText": "$165k - $300k",
    "salaryMin": 165,
    "salaryMax": 300,
    "descriptionPreview": "The range represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role. Individual compensation and level of position offered is determined by t",
    "description": "The range represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role. Individual compensation and level of position offered is determined by the hiring location and additional factors including but not limited to job-related skills, experience, and relevant education or training. In addition to base pay and bonus eligibility, BNSF offers a comprehensive benefits package. This is a full-time remote position. Employees may work from anywhere within the contiguous 48 states of the United States \n \n Travel is up to 20%. Employees will be required to occasionally travel to our corporate headquarters in Fort Worth, TX for in person meetings. Travel expenses for business needs will be covered by BNSF \n \n This position is open to candidates who are currently authorized to work in the United States. We are also open to sponsoring H-1B transfers, TN nonimmigrant status, and STEM OPT candidates with at least 2 years of remaining eligibility. \n \n \n Apply early as this job may be removed or filled prior to the closing date, which is approximately seven (7) days after the posting date. \n \n \n product engineering: bridge the gap between vision and reality by transforming complex rail logistics and workflows into high-performing products that meet user needs, enhance efficiency and accelerate our business. \n \n platform engineering: develop software platforms that enable our product and business teams to be able to develop applications that serve our customers through use of reusable and scalable software services operating with high efficiency . Our platform engineers build software and deliver innovative services that can scale and make other engineering organizations to leverage platforms to enable speed to market. \n \n enterprise engineering: empower the workforce with cutting-edge collaboration tools and services. Our enterprise engineers boost productivity, enhance mobility and ensure reliable systems for finance, human resources legal operations and more. \n \n Key responsibilities may include: \n As a Sr/Staff Software engineer in our teams, you will have the opportunity to learn, develop and deliver high quality software that is highly visible, deliver innovative projects that directly impact our railroad logistics to effectively serve our customers to move freight on time. You will be involved in developing and deploying software for our core freight movement operations that spans across our customer experiences. You will lead the design and development of Software modules built by small group of software engineers and own the end to end delivery of the modules and dependencies. \n \n This is a Front End Engineer role, focusing on framework development for web, mobile devices and mobile web browsers, building experiences with mobile cross platform development frameworks like React Native, Angular, Flutter on Web and mobile. Fluency in Typescript, Javascript, knowledge of Graph QL, rendering frameworks and building Fluid UI that can evolve with AI infused experiences are highly desirable. You will partner closely with UX designers, product and other senior engineers. Your technical design choices of correct UX framework implementations will have direct outcome of customer experiences and business results. You will mentor Junior peers who share a passion for front-end work and you will ensure that teams with limited UI experience can succeed in delivering high quality customer experiences and workflows. \n \n Write production-quality code for well-defined tasks. \n Follow team coding standards and processes. \n Participate in design reviews to learn best practices. \n Write and maintain unit/integration tests. \n Debug and fix straightforward issues. \n Seek feedback proactively and apply it to improve. \n Develop APIs, automation, and tools to improve platform integration. \n Build and maintain monitoring and alerting systems for services. \n Collaborate with application teams to enhance reliability and performance. \n Design and operate cutting edge front end customer experiences and workflows infused with AI. \n Work with BNSF teams to create products that improve rail network operations. \n Innovate in distributed computing and drive industry transformation. \n Build solutions for high-speed, large-scale predictions on distributed systems. \n Solve broad challenges by coding effective solutions in an agile environment. \n Write maintainable and production ready code in web services, web and other front end technologies. \n The duties and responsibilities in this posting are representative categories to be used in deciding whether to apply for this position. This is not an exhaustive list of the position s duties. \n At BNSF Railway, we encourage individuals from all backgrounds to apply, showcasing their skills, experiences and development. We provide resources and tools to help you reach your full potential, fostering a supportive and inclusive environment. \n \n Basic Qualifications \n \n Authorized to work in the US \n Minimum 6 years of software development or related experience \n Experience programming with at least one modern language such as Java, C++, or C# including object-oriented design \n Experience with developing, testing and deploying high quality software in production systems \n Experience (non-internship) with building web application technologies such as Javascript, CSS, AJAX, React \n Experience in web applications design and development \n Experience collaborating with product managers, developers, and other stakeholders \n Demonstrated ability to learn new technical concepts and to adapt to new technologies quickly Strong communication and collaboration skills \n \n \n Preferred Qualifications \n \n Bachelor s degree or higher in computer science, or related field \n Experience building AI applications and using AI as part of Customer experiences and workflows \n Experience coding with latest AI developer tools in IDE environments. \n E",
    "applyUrl": "https://remotive.com/remote-jobs/software-development/product-platform-enterprise-front-end-sr-staff-software-engineer-2088611",
    "tags": [
      "api",
      "AWS",
      "azure",
      "cloud",
      "fullstack",
      "git",
      "kafka",
      "node.js",
      "react",
      "security",
      "sql",
      "AI/ML"
    ],
    "publishedAt": "2026-01-24T14:33:27",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.691Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "af2ae1b1-71cd-42f5-ad87-fa080be53c88",
    "source": "remotive",
    "sourceId": "2088613",
    "title": "Sr/Staff AI Engineer",
    "company": "BNSF Railway",
    "location": "USA",
    "isRemote": true,
    "category": "AI / ML",
    "salaryText": "$165k - $300k",
    "salaryMin": 165,
    "salaryMax": 300,
    "descriptionPreview": "The posted range for this position represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role. Individual compensation and level of position o",
    "description": "The posted range for this position represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role. Individual compensation and level of position offered is determined by the hiring location and additional factors including but not limited to job-related skills, experience, and relevant education or training. In addition to base pay and bonus eligibility, BNSF offers a comprehensive benefits package. This is a full-time remote position . Employees may work from anywhere within the contiguous 48 states of the United States \n \n Travel is up to 20% . Employees will be required to occasionally travel to our corporate headquarters in Fort Worth, TX for in person meetings. Travel expenses for business needs will be covered by BNSF \n \n This position is open to candidates who are currently authorized to work in the United States. We are also open to sponsoring H-1B transfers, TN nonimmigrant status, and STEM OPT candidates with at least 2 years of remaining eligibility. \n \n Apply early as this job may be removed or filled prior to the closing date, which is approximately seven (7) days after the posting date. \n \n \n data &amp; ai: lead our charge into the future as an ai company by transforming our data assets into a real time enterprise. \n \n Key responsibilities may include: \n \n AI Development and Implementation: \n Assist in designing, developing, and implementing AI models and algorithms tailored to railroad operations, including predictive maintenance, scheduling, and safety monitoring. \n Build scalable AI systems to analyze real-time data from rail infrastructure, rolling stock, and IoT devices. \n \n Data Collection and Analysis: \n Collect, preprocess, and clean data from various sources (e.g., sensors, GPS, maintenance logs) for training AI models. \n Conduct exploratory data analysis to identify trends and patterns relevant to rail operations. \n Build and Maintain Extract, Transform, Load (ETL) pipelines for AI applications. \n \n Optimization and Automation: \n Fine tune and optimize algorithms to streamline train scheduling, route planning, and fuel efficiency. \n Support the automation of operational processes and decision-making using AI-powered tools. \n \n System Integration and Deployment: \n Collaborate with software engineers and DevOps teams to integrate AI solutions into production environments. \n Ensure AI systems are robust, reliable, and compliant with railroad industry standards. \n \n Performance Monitoring and Improvement: \n Monitor deployed models and systems for performance, scalability, and accuracy, ensuring continuous improvement and reliability. \n Troubleshoot issues, retrain models, and implement necessary updates. \n \n Collaboration and Communication: \n Work closely with cross-functional teams, including data scientists, software engineers, business analysts, to understand their needs and enable AI-driven solutions. \n Communicate technical concepts and project updates to both technical and non-technical stakeholders. \n \n Research and Innovation: \n Stay updated on emerging AI technologies and trends to identify opportunities for innovation in rail transportation. \n Conduct research and propose new methodologies for solving complex railroad challenges. \n The duties and responsibilities in this posting are representative categories to be used in deciding whether to apply for this position. This is not an exhaustive list of the position s duties. \n At BNSF Railway, we encourage individuals from all backgrounds to apply, showcasing their skills, experiences and development. We provide resources and tools to help you reach your full potential, fostering a supportive and inclusive environment. \n \n Basic Qualifications \n \n Authorized to work in the US. \n Minimum 6 years experience in AI/ML development, data science, software engineering, or relevant experience. \n Technical Skills: \n \n Strong in programming languages such as Python, R, or Java. \n Experience with machine learning frameworks (e.g., TensorFlow, PyTorch, scikit-learn) and deep learning architectures. \n Familiarity with data engineering tools and platforms (e.g., Hadoop, Spark, EMS, AWS S3, PySpark, RDS, JupyterLab) and cloud services (AWS, Azure, Databricks) and open source environments \n Strong knowledge of databases (SQL and NoSQL) \n Strong knowledge of Mlops ecosystem \n Strong understanding of generative AI models \n Strong in Data Pipelines for GenAI (e.g., cleaning, chunking embeddings) \n Strong in GenAI tools and frameworks (LangChain, LangGraph) \n Strong in Vector Databases and embeddings \n Familiar with Agentic architecture \n \n \n Analytical Skills: Ability to interpret complex datasets and derive actionable insights. \n Problem-Solving: Proven ability to tackle real-world challenges using AI and machine learning techniques. \n Communication: Excellent verbal and written communication skills for working with cross-functional teams and stakeholders. \n \n \n Preferred Qualifications \n \n Able to work now and in the future without BNSF s assistance (whether monetary, through sponsorship, or otherwise) in obtaining, maintaining, or extending employment authorization (including H-1B, STEM OPT/CPT, or TN nonimmigrant status). \n Bachelor's degree or higher in Computer Science, Artificial Intelligence, Data Science, Engineering, or a related field \n Experience with predictive maintenance, anomaly detection, or industrial IoT applications. \n Knowledge of railroad operations, transportation systems, or logistics. \n Familiarity with MLOps practices and tools for model lifecycle management. \n Experience deploying AI systems in production environments with a focus on scalability and reliability. \n Previous experience in transportation, supply chain, or infrastructure industries. \n \n \n \n At BNSF, you will have access to a comprehensive and competitive benefits package including: \n \n An industry-leading 401(k) and renowned Railroad Retirement program. \n A range of r",
    "applyUrl": "https://remotive.com/remote-jobs/ai-ml/sr-staff-ai-engineer-2088613",
    "tags": [
      "AWS",
      "azure",
      "cloud",
      "data science",
      "hadoop",
      "java",
      "python",
      "sql",
      "open source",
      "AI/ML",
      "automation",
      "research"
    ],
    "publishedAt": "2026-01-23T21:23:08",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.691Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  },
  {
    "id": "4bd7b8cf-3771-48d5-afd4-4a504a485561",
    "source": "remotive",
    "sourceId": "2070150",
    "title": "Senior DevOps Engineer",
    "company": "Marketerx",
    "location": "USA",
    "isRemote": true,
    "category": "DevOps / Sysadmin",
    "salaryText": "$130k - $150k",
    "salaryMin": 130,
    "salaryMax": 150,
    "descriptionPreview": "The Role: Architect of a Resilient Future \n We are seeking a highly experienced and motivated Senior DevOps/Security Engineer to join our founding engineering team. This isn't just another DevOps role. You will be the ar",
    "description": "The Role: Architect of a Resilient Future \n We are seeking a highly experienced and motivated Senior DevOps/Security Engineer to join our founding engineering team. This isn't just another DevOps role. You will be the architect of the resilient, scalable, and secure foundation upon which our entire autonomous marketing platform is built. As the first dedicated DevOps/Security hire, you will have a unique opportunity to shape our infrastructure from the ground up, ensuring our platform can deliver on its promise of making brilliant marketing effortless. \n \n We're looking for a visionary builder who is passionate about creating robust systems that can handle enterprise-level scale while empowering our customers to compete and win. \n Your Impact: \n \n \n Build the Bedrock: Design and implement a world-class, scalable cloud infrastructure on AWS using Infrastructure as Code (IaC) principles (Terraform, CloudFormation). This is the foundation for amplifying the brilliance of thousands of businesses. \n \n \n Automate Everything: Develop and manage sophisticated CI/CD pipelines to ensure our AI models and applications are deployed rapidly, reliably, and securely. \n \n \n Fortify the Platform: Implement a comprehensive, proactive security program from the ground up. You will be the guardian of our customers' data and our platform's integrity, ensuring compliance with standards like SOC2 and GDPR. \n \n \n Enable Hyper-Growth: Engineer our systems for massive scalability and performance, ensuring we can seamlessly onboard thousands of new customers while maintaining a flawless user experience. \n \n \n Drive Intelligence-Led Operations: Establish robust monitoring, logging, and alerting systems that provide deep insights into system health and performance, allowing for proactive optimization and issue resolution. \n \n \n Who You Are: \n \n \n A seasoned DevOps or SRE professional with 5+ years of experience, bringing a security-first mindset to everything you do. \n \n \n An expert in cloud platforms (preferably AWS), containerization (Docker, Kubernetes), and Infrastructure as Code (Terraform, Ansible). \n \n \n A proactive builder who thrives in a fast-paced, high-growth startup environment. \n \n \n You're not just looking for a job; you're looking to join a mission-driven team with a proven leader and build something that will redefine an industry. \n \n \n You are inspired by the challenge of building a platform that levels the playing field for visionary entrepreneurs. \n \n \n What We Offer: \n \n \n Competitive Salary:  130,000 -  150,000 annually. \n \n \n Founding Team Equity: A generous equity package, because you are a crucial part of our success story. \n \n \n Comprehensive Benefits: flexible work schedule, and unlimited PTO. \n \n \n Unmatched Opportunity: The chance to build the infrastructure for a category-defining company and work alongside a world-class team.",
    "applyUrl": "https://remotive.com/remote-jobs/devops/senior-devops-engineer-2070150",
    "tags": [
      "AWS",
      "cloud",
      "docker",
      "kubernetes",
      "security",
      "SRE",
      "AI/ML",
      "CI/CD",
      "terraform",
      "startup",
      "ansible",
      "infrastructure"
    ],
    "publishedAt": "2026-01-18T14:31:16",
    "matchScore": 0,
    "highMatch": false,
    "createdAt": "2026-02-16T17:01:24.691Z",
    "updatedAt": "2026-02-18T00:40:00.072Z"
  }
]